product/load-tests/constant-load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 120
      arrivalRate: 20
      name: "Carga mantenida a razon de 20 peticiones por minuto durante 2 minutos"
scenarios:
  - name: Constant load test
    flow:
      - get:
          url: "/prices?brandId=1&productId=35455&date=2020-06-14T10:00:00Z"