product/load-tests/smoke-test.yml
config:
  target: "https://itx-test-smxc.onrender.com"
  phases:
    - duration: 10
      arrivalRate: 1
scenarios:
  - name: Smoke test - simple request
    flow:
      - get:
          url: "/prices?brandId=1&productId=35455&date=2020-06-14 10:00:00"
          headers:
            Authorization: "Basic dXNlcjpwYXNzd29yZA=="