product/load-tests/smoke-test.yml
config:
  target: "https://itx-test-smxc.onrender.com"
  phases:
    - duration: 10
      arrivalRate: 1
  http:
    auth:
      user: "user"
      pass: "password"
scenarios:
  - name: Smoke test - simple request
    flow:
      - get:
          url: "/prices?brandId=1&productId=35455&date=2020-06-14 10:00:00"